In [1]:
import pandas as pd

In [2]:
url="https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"

In [5]:
f=pd.read_csv(url,sep="|")
f

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [6]:
f.head(25)

    user_id  age gender     occupation zip_code
0         1   24      M     technician    85711
1         2   53      F          other    94043
2         3   23      M         writer    32067
3         4   24      M     technician    43537
4         5   33      F          other    15213
5         6   42      M      executive    98101
6         7   57      M  administrator    91344
7         8   36      M  administrator    05201
8         9   29      M        student    01002
9        10   53      M         lawyer    90703
10       11   39      F          other    30329
11       12   28      F          other    06405
12       13   47      M       educator    29206
13       14   45      M      scientist    55106
14       15   49      F       educator    97301
15       16   21      M  entertainment    10309
16       17   30      M     programmer    06355
17       18   35      F          other    37212
18       19   40      M      librarian    02138
19       20   42      F      homemaker    95660
20       21   26      M         writer    30068
21       22   25      M         writer    40206
22       23   30      F         artist    48197
23       24   21      F         artist    94533
24       25   39      M       engineer    55107

In [8]:
f.tail(10)

     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

In [10]:
f.shape[0]

943

In [12]:
f.shape[1]

5

In [15]:
f.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [17]:
f.columns.tolist()

['user_id', 'age', 'gender', 'occupation', 'zip_code']

In [19]:
f.index

RangeIndex(start=0, stop=943, step=1)

In [22]:
f.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [24]:
f['age'].dtype

dtype('int64')

In [26]:
f['occupation']

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

In [28]:
f['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [31]:
f['occupation'].value_counts().max

<bound method NDFrame._add_numeric_operations.<locals>.max of student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64>

In [33]:
f['occupation'].value_counts().max()

196

In [36]:
f['occupation'].value_counts().idxmax()

'student'

In [39]:
f['occupation'].nunique()

21

In [41]:
f['occupation'].unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [44]:
f['occupation'].unique().tolist()

['technician',
 'other',
 'writer',
 'executive',
 'administrator',
 'student',
 'lawyer',
 'educator',
 'scientist',
 'entertainment',
 'programmer',
 'librarian',
 'homemaker',
 'artist',
 'engineer',
 'marketing',
 'none',
 'healthcare',
 'retired',
 'salesman',
 'doctor']

In [46]:
f.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

In [48]:
f.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [50]:
f['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [52]:
f['age'].mean()

34.05196182396607

In [54]:
f['age'].min()

7

In [56]:
import pandas as pd
import numpy as np
marks=np.random.randint(0,100,150).reshape(30,5)
rno=[i for i in range(301,331)]
df=pd.DataFrame(data=marks,index=rno,columns=['IAT','CO','CS','PMT','BI'])
df

     IAT  CO  CS  PMT  BI
301   63  75  28    8  92
302    3  94  58   12  13
303   77  39   3   25  76
304   82  26  79    6  84
305    6  11  85   11  40
306   39  84  34   90  37
307   62   9  32   40  30
308   68  74  18   69   6
309   50   1  15   27  71
310   38  89  78   25   8
311   29  93  64    6  81
312   60  50  89   87  60
313   54  76  68   94  13
314   55   9  11   14   5
315    3  20  51    5  69
316   77   0  92   27  46
317   70  99  97   65  29
318   11   7  35   94  98
319   59   6  63   38  30
320   78  94  17   57  90
321   82  59  40   81  64
322   98  45  98   88  61
323   17  55  28   45  62
324   69  71   9   60  68
325   23  50  61   37  89
326   64  61  97   57  93
327   36  33  48   30  34
328    9  26  11   21  77
329   46  87  49   24  93
330   87  36  42   51  52